tests/performance/artillery-realtime-v2.yml
# Artillery Realtime WebSocket Performance Test v2
# 即時服務 WebSocket 效能測試 - 使用正確的 Token 認證流程
# 創建日期: 2025-12-06

config:
  # WebSocket 目標
  target: "ws://localhost:8788"

  # HTTP 請求目標（用於獲取 token）
  http:
    timeout: 10

  phases:
    # Phase 1: 基礎連線測試（低負載）
    - duration: 30
      arrivalRate: 2
      name: "Warm-up - Basic Connection Test"

    # Phase 2: 逐步增加負載
    - duration: 60
      arrivalRate: 5
      rampTo: 15
      name: "Ramp-up Load"

    # Phase 3: 穩定負載測試
    - duration: 60
      arrivalRate: 15
      name: "Sustained Load"

    # Phase 4: 峰值負載
    - duration: 30
      arrivalRate: 25
      name: "Peak Load"

    # Phase 5: 降溫
    - duration: 30
      arrivalRate: 5
      name: "Cool-down"

  # 效能指標門檻 — 對齊 CLAUDE.md 效能目標（WebSocket Latency < 50ms）
  ensure:
    # 中位數延遲 < 50ms（CLAUDE.md: WebSocket Latency < 50ms）
    - median: 50
    # P95 延遲 < 100ms
    - p95: 100
    # P99 延遲 < 200ms
    - p99: 200

  # 插件配置
  plugins:
    expect: {}
    metrics-by-endpoint: {}

  # 環境變數
  variables:
    apiUrl: "http://localhost:8787"
    restaurantId: "1"

  # 使用 processor
  processor: "./artillery-processor.js"

scenarios:
  # 場景 1: Kitchen WebSocket 連線（使用 Token）
  - name: "Kitchen WebSocket with Auth"
    weight: 30
    engine: ws
    flow:
      # 1. 獲取 Kitchen Token
      - function: "getKitchenToken"

      # 2. 建立 WebSocket 連線
      - connect:
          target: "ws://localhost:8788/kitchen/{{ roomId }}?token={{ token }}"

      # 3. 等待連線確認
      - think: 1

      # 4. 發送 ping 訊息
      - send:
          payload: '{"type":"ping","timestamp":{{ $timestamp }}}'

      # 5. 訂閱事件
      - send:
          payload: '{"type":"subscribe","data":{"eventTypes":["new_order","order_status_update","kitchen_queue_update"]}}'

      # 6. 保持連線並發送心跳
      - think: 10

      # 7. 多次心跳測試
      - loop:
          - send:
              payload: '{"type":"ping"}'
          - think: 3
        count: 5

      # 8. 結束連線
      - think: 2

  # 場景 2: Admin WebSocket 連線
  - name: "Admin WebSocket with Auth"
    weight: 30
    engine: ws
    flow:
      # 1. 獲取 Admin Token
      - function: "getAdminToken"

      # 2. 建立 WebSocket 連線
      - connect:
          target: "ws://localhost:8788/admin/{{ roomId }}?token={{ token }}"

      # 3. 等待連線
      - think: 1

      # 4. 發送 ping
      - send:
          payload: '{"type":"ping"}'

      # 5. 保持連線
      - think: 20

      # 6. 心跳循環
      - loop:
          - send:
              payload: '{"type":"ping"}'
          - think: 5
        count: 3

  # 場景 3: Customer WebSocket 連線
  - name: "Customer WebSocket with Auth"
    weight: 30
    engine: ws
    flow:
      # 1. 獲取 Customer Token
      - function: "getCustomerToken"

      # 2. 建立 WebSocket 連線
      - connect:
          target: "ws://localhost:8788/customer/{{ roomId }}?token={{ token }}"

      # 3. 等待連線
      - think: 1

      # 4. 發送 ping
      - send:
          payload: '{"type":"ping"}'

      # 5. 訂閱事件
      - send:
          payload: '{"type":"subscribe","data":{"eventTypes":["order_status_update","menu_availability_update"]}}'

      # 6. 模擬顧客瀏覽（較長連線時間）
      - think: 30

      # 7. 心跳
      - loop:
          - send:
              payload: '{"type":"ping"}'
          - think: 10
        count: 3

  # 場景 4: 高頻訊息測試（壓力測試）
  - name: "High Frequency Message Test"
    weight: 10
    engine: ws
    flow:
      # 1. 獲取 Kitchen Token（廚房場景最需要高頻更新）
      - function: "getKitchenToken"

      # 2. 連線
      - connect:
          target: "ws://localhost:8788/kitchen/{{ roomId }}?token={{ token }}"

      # 3. 等待連線
      - think: 1

      # 4. 快速發送 50 個 ping（壓力測試）
      - loop:
          - send:
              payload: '{"type":"ping"}'
          - think: 0.2
        count: 50

      # 5. 正常結束
      - think: 2