tests/performance/artillery-websocket.yml
# Artillery WebSocket Performance Test Configuration
# 即時通訊系統 WebSocket 性能測試

config:
  target: "ws://localhost:8788"
  phases:
    # Phase 1: 暖身階段
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"

    # Phase 2: 負載增長
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up load"

    # Phase 3: 穩定負載
    - duration: 180
      arrivalRate: 50
      name: "Sustained load"

    # Phase 4: 峰值負載
    - duration: 60
      arrivalRate: 100
      name: "Peak load"

    # Phase 5: 降載
    - duration: 60
      arrivalRate: 10
      name: "Cool-down"

  # 性能指標設定 — 對齊 CLAUDE.md 效能目標（WebSocket Latency < 50ms）
  ensure:
    # WebSocket 連線成功率 > 99%
    - ws.connection_success_rate:
        min: 99
    # 中位數延遲 < 50ms（CLAUDE.md: WebSocket Latency < 50ms）
    - ws.response_time.median:
        max: 50
    # 訊息延遲 P95 < 100ms
    - ws.response_time.p95:
        max: 100
    # 訊息延遲 P99 < 200ms
    - ws.response_time.p99:
        max: 200

  # 插件配置
  plugins:
    expect: {}
    metrics-by-endpoint:
      # 按端點統計 metrics
      stripQueryString: false

  # 環境變數
  variables:
    api_url: "http://localhost:8787"

scenarios:
  # 場景 1: Kitchen 連線測試
  - name: "Kitchen WebSocket Connection"
    engine: ws
    flow:
      # 1. 獲取 WebSocket Token
      - function: "getKitchenToken"

      # 2. 建立 WebSocket 連線
      - connect:
          url: "/kitchen/{{ roomId }}?token={{ token }}"

      # 3. 等待 connection_ack
      - think: 1

      # 4. 發送 ping
      - send:
          payload: '{"type":"ping"}'

      # 5. 等待 pong
      - think: 1

      # 6. 訂閱事件
      - send:
          payload: '{"type":"subscribe","data":{"eventTypes":["new_order","order_status_update"]}}'

      # 7. 持續連線並接收訊息
      - think: 30

      # 8. 發送多個 ping 測試心跳
      - loop:
          - send:
              payload: '{"type":"ping"}'
          - think: 5
        count: 5

      # 9. 斷開連線
      - think: 2

  # 場景 2: Admin 連線測試
  - name: "Admin WebSocket Connection"
    weight: 30  # 30% 的流量
    engine: ws
    flow:
      - function: "getAdminToken"
      - connect:
          url: "/admin/{{ roomId }}?token={{ token }}"
      - think: 1
      - send:
          payload: '{"type":"ping"}'
      - think: 30
      - loop:
          - send:
              payload: '{"type":"ping"}'
          - think: 5
        count: 3

  # 場景 3: Customer 連線測試（需要有效的 table ID）
  - name: "Customer WebSocket Connection"
    weight: 40  # 40% 的流量
    engine: ws
    flow:
      - function: "getCustomerToken"
      - connect:
          url: "/customer/{{ roomId }}?token={{ token }}"
      - think: 1
      - send:
          payload: '{"type":"ping"}'
      - think: 60  # Customer 連線通常較長
      - loop:
          - send:
              payload: '{"type":"ping"}'
          - think: 10
        count: 5

  # 場景 4: 訊息洪流測試（高頻率訊息）
  - name: "Message Flood Test"
    weight: 10
    engine: ws
    flow:
      - function: "getKitchenToken"
      - connect:
          url: "/kitchen/{{ roomId }}?token={{ token }}"
      - think: 1
      # 快速發送 100 個 ping
      - loop:
          - send:
              payload: '{"type":"ping"}'
          - think: 0.1
        count: 100

# 自定義函式（需要在 processor.js 中實作）
processor: "./tests/performance/artillery-processor.js"